Documents/ден_ПланируемоеПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ден_ПланируемоеПоступлениеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.СчетНаОплатуПокупателю</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеИсходящее</xr:Item>
				<xr:Item>Document.РеализацияУслугПоПереработке</xr:Item>
				<xr:Item>Document.АктОбОказанииПроизводственныхУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.фин_ФактическиеОборотыБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.фин_ОборотыБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.ден_ПредполагаемыеПоступленияПоБюджетам</xr:Item>
				<xr:Item>AccumulationRegister.ден_ПланируемыеПоступленияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.фин_КонтролируемыеФинансовыеПоказатели</xr:Item>
				<xr:Item>AccumulationRegister.Удалить_фин_ОстаткиБюджетов</xr:Item>
				<xr:Item>AccountingRegister.фин_Бюджетирование</xr:Item>
				<xr:Item>AccumulationRegister.фин_ПрогнозИсполненияБюджетов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ден_ВидыОперацийПланируемоеПоступлениеДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПлатежныйКалендарь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетнаяДатаПрихода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ден_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.дог_ЭтапыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Comment>Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыРаспределенияПоПроектам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>фин_ЗначенияДополнительныхРеквизитовБюджетирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитБюджетирования</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БюджетныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/фин_ФактическиеПоказателиБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ФактическиеПоказателиБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправленческоеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Валюта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодПланирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ден_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ден_ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРасчетнымДокументам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ден_ПланируемоеПоступлениеДенежныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПоНесколькимПроектам(Объект, ЕстьРасчетыСКонтрагентами, ЕстьРасчетыПоКредитам) Экспорт
	
	Если ЕстьРасчетыСКонтрагентами Или ЕстьРасчетыПоКредитам Тогда
		Если Объект.РасшифровкаПлатежа.Количество() > 1 Тогда
			ТаблицаПроекты = Объект.РасшифровкаПлатежа.Выгрузить(,"Проект");
			ТаблицаПроекты.Свернуть("Проект");
			Если ТаблицаПроекты.Количество() > 1 Тогда
				Возврат Истина;
			ИначеЕсли ТаблицаПроекты.Количество() = 1 Тогда
				Возврат (ЗначениеЗаполнено(ТаблицаПроекты[0].Проект) И ТипЗнч(ТаблицаПроекты[0].Проект) = фин_ОбщегоНазначенияВызовСервераПовтИсп.ТипСправочникВидыРаспределенияПоПроектам());
			Иначе
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Функция ЗаполнитьБюджетныеПараметры(Объект, КЭШ_Разрезы, ЕстьРасчетыСКонтрагентами, ЕстьРасчетыПоКредитам) Экспорт

	Объект.БюджетныеПараметры.Очистить();
	
	НоваяСтрока = Объект.БюджетныеПараметры.Добавить();
	НоваяСтрока.Измерение	= Перечисления.фин_ФактическиеПоказателиБюджетирования.Контрагент;
	НоваяСтрока.Разрез 		= ПланыВидовХарактеристик.фин_ВидыСубконтоБюджетирования.Контрагенты;
	НоваяСтрока.Значение 	= Объект.Контрагент;
	
	НоваяСтрока = Объект.БюджетныеПараметры.Добавить();
	НоваяСтрока.Измерение	= Перечисления.фин_ФактическиеПоказателиБюджетирования.УправленческоеПодразделение;
	НоваяСтрока.Разрез 		= ПланыВидовХарактеристик.фин_ВидыСубконтоБюджетирования.ЦФО;
	НоваяСтрока.Значение 	= Объект.ЦФО;
	
	НесколькоПроектов = ПоНесколькимПроектам(Объект, ЕстьРасчетыСКонтрагентами, ЕстьРасчетыПоКредитам);
	
	Если НЕ Объект.ФинансовыйПоказатель.Пустая() Тогда
		Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
			СтрокаРасшифровки = Объект.РасшифровкаПлатежа[0];
			
			Если Не НесколькоПроектов Тогда
				НоваяСтрока = Объект.БюджетныеПараметры.Добавить();
				НоваяСтрока.Измерение	= Перечисления.фин_ФактическиеПоказателиБюджетирования.Проект;
				НоваяСтрока.Разрез 		= ПланыВидовХарактеристик.фин_ВидыСубконтоБюджетирования.Проекты;
				НоваяСтрока.Значение 	= СтрокаРасшифровки.Проект;
			КонецЕсли;
			
			Тип = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств");
			СписокРазрезов = фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПолучитьСписокРазрезовСтатьи(Объект.ФинансовыйПоказатель);
			Для Каждого Разрез Из СписокРазрезов Цикл
				ЭПВХ = фин_РаботаСДополнительнымиРазрезамиБюджетирования.РазрезПоИзмерению(Разрез.Значение,КЭШ_Разрезы);
				Если ЭПВХ.ТипЗначения.СодержитТип(Тип) Тогда
					НоваяСтрока = Объект.БюджетныеПараметры.Добавить();
					НоваяСтрока.Измерение	= Разрез.Значение;
					НоваяСтрока.Разрез 		= ЭПВХ;
					НоваяСтрока.Значение 	= СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств;
				КонецЕсли;
			КонецЦикла;
		Иначе
			НоваяСтрока = Объект.БюджетныеПараметры.Добавить();
			НоваяСтрока.Измерение	= Перечисления.фин_ФактическиеПоказателиБюджетирования.Проект;
			НоваяСтрока.Разрез 		= ПланыВидовХарактеристик.фин_ВидыСубконтоБюджетирования.Проекты;
			НоваяСтрока.Значение 	= Справочники.Проекты.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;


КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Заполнение

// Процедура выполняет заполнение документа по документу-основанию.
//
// Параметры:
// 	Объект - документ
//  ДокументОснование - ссылка на документ основание.
//
Процедура ЗаполнитьПоДокументуОснованию(Объект, ДокументОснование) Экспорт
	
	фин_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Объект, фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета"), , , , ДокументОснование);
	
	Объект.ДокументОснование = ДокументОснование;
	
	Организация = Объект.Организация;
	ФормаОплаты = Объект.ФормаОплаты;	
	БанковскийСчетКасса = Объект.БанковскийСчетКасса;
		
	Если ФормаОплаты.Пустая() Тогда
		ФормаОплаты = Перечисления.ден_ВидыДенежныхСредств.Наличные;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(БанковскийСчетКасса) Тогда
		Если ФормаОплаты = Перечисления.ден_ВидыДенежныхСредств.Наличные Тогда
			БанковскийСчетКасса = Организация.ОсновнаяКасса;
		Иначе
			БанковскийСчетКасса = Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчетКасса) Тогда
		Объект.ВалютаДокумента = фин_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(БанковскийСчетКасса, "ВалютаДенежныхСредств");
	Иначе
		Объект.ВалютаДокумента = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		ЗаполнитьДокументПоСчетуНаОплатуПокупателю(Объект, ДокументОснование);
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ЗаполнитьДокументПоРеализацииТоваровУслуг(Объект, ДокументОснование);
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		ЗаполнитьДокументПоРеализацииУслугПоПереработке(Объект, ДокументОснование);
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		ЗаполнитьДокументПоВозвратуТоваровПоставщику(Объект, ДокументОснование);
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
		ЗаполнитьДокументПоПлатежномуПоручениюИсходящему(Объект, ДокументОснование);
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		ЗаполнитьДокументПоАктуОбОказанииПроизводственныхУслуг(Объект, ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоДокументуОснованию()

Процедура ЗаполнитьДокументПоСчетуНаОплатуПокупателю(Объект, Основание)
	
	Объект.Контрагент = Основание.Контрагент;
	
	
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	//СпособЗаполнения = "Не заполнять";
	СпособЗаполнения = "По сумме документа" ;
	
	СтрокаПлатеж.ДоговорКонтрагента   	 	= Основание.ДоговорКонтрагента;
	СтруктураКурсаВзаиморасчетов        	= ОбщегоНазначения.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.Дата);
	СтрокаПлатеж.КурсВзаиморасчетов      	= СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов 	= СтруктураКурсаВзаиморасчетов.Кратность;
	
	Если СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам Тогда
		СтрокаПлатеж.Сделка = Основание;
	КонецЕсли;

	Объект.ВидОперации = Перечисления.ден_ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя;

	Если ЗначениеЗаполнено(Основание.СтруктурнаяЕдиница) Тогда
		Если ТипЗнч(Основание.СтруктурнаяЕдиница) = Тип("СправочникСсылка.Кассы") Тогда
			Объект.ФормаОплаты = Перечисления.ден_ВидыДенежныхСредств.Наличные;
		Иначе
			Объект.ФормаОплаты = Перечисления.ден_ВидыДенежныхСредств.Безналичные;
		КонецЕсли;
		Объект.БанковскийСчетКасса = Основание.СтруктурнаяЕдиница;
	Иначе
		Объект.ФормаОплаты = Перечисления.ден_ВидыДенежныхСредств.Наличные;
		Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчетКасса) Тогда
			Объект.БанковскийСчетКасса = Объект.Организация.ОсновнаяКасса;
		КонецЕсли;
	КонецЕсли;

	СтруктураКурсаДокумента = фин_ОбщегоНазначенияСервер.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.ДатаПоступления);
	КурсДокумента           = СтруктураКурсаДокумента.Курс;
	КратностьДокумента      = СтруктураКурсаДокумента.Кратность;

	Если СпособЗаполнения = "По сумме документа" Тогда

		СтруктураКурсаОснования 	= ОбщегоНазначения.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования 				= СтруктураКурсаОснования.Курс;
		КратностьОснования 			= СтруктураКурсаОснования.Кратность;

		ОснованиеСуммаДокумента 	= Основание.СуммаДокумента;

		СтрокаПлатеж.СуммаВзаиморасчетов = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(ОснованиеСуммаДокумента, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
		                                   КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
		СуммаДокумента = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.ВалютаДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		                 КурсДокумента, СтрокаПлатеж.КратностьВзаиморасчетов,КратностьДокумента);

		СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;
	
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДокументПоРеализацииТоваровУслуг(Объект, Основание)
	
	//Объект.Контрагент = Основание.Контрагент;
	
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	СпособЗаполнения = "Не заполнять";
	
	СтрокаПлатеж.ДоговорКонтрагента   		= Основание.ДоговорКонтрагента;
	СтруктураКурсаВзаиморасчетов         	= ОбщегоНазначения.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.Дата);
	СтрокаПлатеж.КурсВзаиморасчетов      	= СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов 	= СтруктураКурсаВзаиморасчетов.Кратность;

	Объект.ВидОперации = Перечисления.ден_ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя;

	Если ЗначениеЗаполнено(Объект.Контрагент.ОсновнойБанковскийСчет) Тогда
		СчетКонтрагента = Объект.Контрагент.ОсновнойБанковскийСчет;
	КонецЕсли;

	СчетОрганизации     = Объект.Организация.ОсновнойБанковскийСчет;

	Если СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам Тогда
		СтрокаПлатеж.Сделка = Основание;
	КонецЕсли;
	
	СпособЗаполнения = "По сумме документа";

	Если НЕ СчетОрганизации.Пустая() Тогда
		Объект.ВалютаДокумента = СчетОрганизации.ВалютаДенежныхСредств;
	Иначе
		Объект.ВалютаДокумента = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;

	СтруктураКурсаДокумента = ОбщегоНазначения.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	Объект.КурсДокумента           = СтруктураКурсаДокумента.Курс;
	Объект.КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
	
	Если СпособЗаполнения = "По сумме документа" Тогда

		СтруктураКурсаОснования 	= ОбщегоНазначения.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования 				= СтруктураКурсаОснования.Курс;
		КратностьОснования 			= СтруктураКурсаОснования.Кратность;

		ОснованиеСуммаДокумента 	= Основание.СуммаДокумента;

		СтрокаПлатеж.СуммаВзаиморасчетов = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(ОснованиеСуммаДокумента, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
		                                   КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
		Объект.СуммаДокумента = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.ВалютаДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		                 Объект.КурсДокумента, СтрокаПлатеж.КратностьВзаиморасчетов,Объект.КратностьДокумента);

		СтрокаПлатеж.СуммаПлатежа = Объект.СуммаДокумента;
		
	КонецЕсли;

	Объект.Контрагент = Основание.Контрагент;
	Объект.Организация = Основание.Организация;
	Объект.СтруктурноеПодразделение = Основание.СтруктурноеПодразделение;
КонецПроцедуры

Процедура ЗаполнитьДокументПоРеализацииУслугПоПереработке(Объект, Основание)
	
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	СпособЗаполнения = "Не заполнять";
	
	СтрокаПлатеж.ДоговорКонтрагента   		= Основание.ДоговорКонтрагента;
	СтруктураКурсаВзаиморасчетов         	= ОбщегоНазначения.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.Дата);
	СтрокаПлатеж.КурсВзаиморасчетов      	= СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов 	= СтруктураКурсаВзаиморасчетов.Кратность;

	ВидОперации = Перечисления.ден_ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя;

	Если ЗначениеЗаполнено(Объект.Контрагент.ОсновнойБанковскийСчет) Тогда
		СчетКонтрагента = Объект.Контрагент.ОсновнойБанковскийСчет;
	КонецЕсли;

	СчетОрганизации     = Объект.Организация.ОсновнойБанковскийСчет;

	Если СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам Тогда
		СтрокаПлатеж.Сделка = Основание;
	КонецЕсли;
	
	СпособЗаполнения = "По сумме документа";

	Если НЕ СчетОрганизации.Пустая() Тогда
		ВалютаДокумента = СчетОрганизации.ВалютаДенежныхСредств;
	Иначе
		ВалютаДокумента = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;

	СтруктураКурсаДокумента = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаДокумента, Объект.Дата);
	КурсДокумента           = СтруктураКурсаДокумента.Курс;
	КратностьДокумента      = СтруктураКурсаДокумента.Кратность;

	Если СпособЗаполнения = "По сумме документа" Тогда

		СтруктураКурсаОснования 	= ОбщегоНазначения.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования 				= СтруктураКурсаОснования.Курс;
		КратностьОснования 			= СтруктураКурсаОснования.Кратность;

		ОснованиеСуммаДокумента 	= Основание.СуммаДокумента;

		СтрокаПлатеж.СуммаВзаиморасчетов = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(ОснованиеСуммаДокумента, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
		                                   КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
		СуммаДокумента = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.ВалютаДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		                 КурсДокумента, СтрокаПлатеж.КратностьВзаиморасчетов,КратностьДокумента);

		СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьДокументПоВозвратуТоваровПоставщику(Объект, Основание)
	
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	СпособЗаполнения = "Не заполнять";
	
	ВидОперации = Перечисления.ден_ВидыОперацийПланируемоеПоступлениеДС.ВозвратДенежныхСредствПоставщиком;
	Контрагент  = Основание.Контрагент;

	СтрокаПлатеж.ДоговорКонтрагента   		= Основание.ДоговорКонтрагента;
	СтруктураКурсаВзаиморасчетов         	= ОбщегоНазначения.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.Дата);
	СтрокаПлатеж.КурсВзаиморасчетов      	= СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов 	= СтруктураКурсаВзаиморасчетов.Кратность;

	Если ЗначениеЗаполнено(Контрагент.ОсновнойБанковскийСчет) Тогда
		СчетКонтрагента = Контрагент.ОсновнойБанковскийСчет;
	КонецЕсли;

	СчетОрганизации = Объект.Организация.ОсновнойБанковскийСчет;

	Если СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам Тогда
		СтрокаПлатеж.Сделка = Основание;
	КонецЕсли;
		
	Если Основание.Проведен Тогда
		СпособЗаполнения = "По сумме документа";
	КонецЕсли;

	Если НЕ СчетОрганизации.Пустая() Тогда
		ВалютаДокумента = СчетОрганизации.ВалютаДенежныхСредств;
	Иначе
		ВалютаДокумента = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;

	СтруктураКурсаДокумента = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаДокумента, Объект.Дата);
	КурсДокумента           = СтруктураКурсаДокумента.Курс;
	КратностьДокумента      = СтруктураКурсаДокумента.Кратность;

	Если СпособЗаполнения = "По сумме документа" Тогда

		СтруктураКурсаОснования 	= ОбщегоНазначения.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования 				= СтруктураКурсаОснования.Курс;
		КратностьОснования 			= СтруктураКурсаОснования.Кратность;

		ОснованиеСуммаДокумента 	= Основание.СуммаДокумента;

		СтрокаПлатеж.СуммаВзаиморасчетов = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(ОснованиеСуммаДокумента, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
		                                   КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
		СуммаДокумента = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.ВалютаДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		                 КурсДокумента, СтрокаПлатеж.КратностьВзаиморасчетов,КратностьДокумента);

		СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДокументПоПлатежномуПоручениюИсходящему(Объект, Основание)
	
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	СпособЗаполнения = "Не заполнять";
	
	ВидОперации = Перечисления.ден_ВидыОперацийПланируемоеПоступлениеДС.ПрочиеРасчетыСКонтрагентами;
	ФормаОплаты=Перечисления.ден_ВидыДенежныхСредств.Безналичные;
	
	БанковскийСчетКасса = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	СчетОрганизации     = Объект.Организация.ОсновнойБанковскийСчет;
	
	Если НЕ СчетОрганизации.Пустая() Тогда
		ВалютаДокумента = СчетОрганизации.ВалютаДенежныхСредств;
	Иначе
		ВалютаДокумента = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;

	СтруктураКурсаДокумента = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаДокумента, Объект.Дата);
	КурсДокумента           = СтруктураКурсаДокумента.Курс;
	КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
	
	СтрокаПлатеж.СуммаПлатежа = Основание.СуммаДокумента;
	
	Если СпособЗаполнения = "По сумме документа" Тогда

		СтруктураКурсаОснования = ОбщегоНазначения.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования 			= СтруктураКурсаОснования.Курс;
		КратностьОснования 		= СтруктураКурсаОснования.Кратность;

		ОснованиеСуммаДокумента = Основание.СуммаДокумента;

		СтрокаПлатеж.СуммаВзаиморасчетов = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(ОснованиеСуммаДокумента, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
		                                   КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
		СуммаДокумента = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.ВалютаДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		                 КурсДокумента, СтрокаПлатеж.КратностьВзаиморасчетов,КратностьДокумента);

		СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДокументПоАктуОбОказанииПроизводственныхУслуг(Объект, Основание)
	
	Объект.Контрагент = Основание.Контрагент;
	//Объект.Подразделение = Основание.Подразделение
	СтрокаПлатеж = Объект.РасшифровкаПлатежа.Добавить();
	СпособЗаполнения = "Не заполнять";
	
	СтрокаПлатеж.ДоговорКонтрагента   		= Основание.ДоговорКонтрагента;
	СтруктураКурсаВзаиморасчетов         	= ОбщегоНазначения.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.Дата);
	СтрокаПлатеж.КурсВзаиморасчетов      	= СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов 	= СтруктураКурсаВзаиморасчетов.Кратность;

	Объект.ВидОперации = Перечисления.ден_ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя;

	Если ЗначениеЗаполнено(Объект.Контрагент.ОсновнойБанковскийСчет) Тогда
		СчетКонтрагента = Объект.Контрагент.ОсновнойБанковскийСчет;
	КонецЕсли;

	СчетОрганизации     = Объект.Организация.ОсновнойБанковскийСчет;

	Если СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоРасчетнымДокументам Тогда
		СтрокаПлатеж.Сделка = Основание;
	КонецЕсли;
	
	СпособЗаполнения = "По сумме документа";

	Если НЕ СчетОрганизации.Пустая() Тогда
		Объект.ВалютаДокумента = СчетОрганизации.ВалютаДенежныхСредств;
	Иначе
		Объект.ВалютаДокумента = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;

	СтруктураКурсаДокумента = ОбщегоНазначения.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	КурсДокумента           = СтруктураКурсаДокумента.Курс;
	КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
	
	Если СпособЗаполнения = "По сумме документа" Тогда

		СтруктураКурсаОснования 	= ОбщегоНазначения.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования 				= СтруктураКурсаОснования.Курс;
		КратностьОснования 			= СтруктураКурсаОснования.Кратность;

		ОснованиеСуммаДокумента 	= Основание.СуммаДокумента;

		СтрокаПлатеж.СуммаВзаиморасчетов = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(ОснованиеСуммаДокумента, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
		                                   КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
		СуммаДокумента = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Объект.ВалютаДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		                 КурсДокумента, СтрокаПлатеж.КратностьВзаиморасчетов,КратностьДокумента);

		СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;
		
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = фин_УправлениеПроведениемДокументовСервер.ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ);
	
	ТаблицаРасшифровкаПлатежа = ПараметрыПроведения.ТаблицаРасшифровкаПлатежа;
	Если ТаблицаРасшифровкаПлатежа <> Неопределено Тогда
		КолонкиГруппировок = "ДоговорКонтрагента,Сделка,КурсВзаиморасчетов,КратностьВзаиморасчетов,СтатьяДвиженияДенежныхСредств,Проект";
		ПараметрыПроведения.ТаблицаРасшифровкаПлатежа.Свернуть(КолонкиГруппировок, "СуммаПлатежа, СуммаВзаиморасчетов");
	КонецЕсли; 

	Возврат ПараметрыПроведения;

КонецФункции 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
		
КонецПроцедуры

#КонецЕсли
